app/controllers/books_controller.rb

  def random
    @books = Book.find :all, :order => 'RAND()', :limit => 10
---
SELECT * FROM `books` ORDER BY RAND() LIMIT 10

  def create
    book = Book.new params[:book]
    if book.save
---
INSERT INTO `books` (`license`, `updated_at`, `title`, `text`, `url`, `author`, `subtitle`, `locale`, `bio`, `password`, `email`, `created_at`) VALUES(NULL, '2009-05-25 22:08:01', 'The legend of the three monks', '', NULL, 'Florian Hanke', 'In which an old man finds youth', NULL, NULL, 'drslim', 'florian.hanke@gmail.com', '2009-05-25 22:08:01')

  def show
    @book = Book.find_by_url params[:url]
---
SELECT * FROM `books` WHERE (`books`.`url` = 'the-legend-of-the-three-monks') LIMIT 1

  def edit
    @book = Book.find_by_url params[:url]
---
SELECT * FROM `books` WHERE (`books`.`url` = 'bla') LIMIT 1

  def update
    book = Book.find_by_url params[:url]
    text = params[:book][:text]
    if book && text
      book.update_attribute :text, text
---
SELECT * FROM `books` WHERE (`books`.`url` IS NULL) LIMIT 1
UPDATE `books` SET `updated_at` = '2009-06-28 20:49:09', `size` = 2927, `url` = 'hello-it-s-me-again-period' WHERE `id` = 14