app/controllers/books_controller.rb

SELECT * FROM `books` WHERE (`books`.`id` = 'the-tale-of-the-two-towers') LIMIT 1
---
  def show
    book = Book.find_by_id params[:id]