app/controllers/pdf_controller.rb

  def create
    book = Book.find_by_url params[:url]
---
SELECT * FROM `books` WHERE (`books`.`url` = 'the-fish') LIMIT 1